IDEA StatiCa Open Model
CutBeamByBeamData.WeldThickness Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Thickness of the weld - value 0 = recommended size
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double WeldThickness { get; set; }
Public Property WeldThickness As Double
	Get
	Set
public:
property double WeldThickness {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
CutBeamByBeamData Class
IdeaRS.OpenModel.Connection Namespace